
{
    "object_appearance_order":"Identify the order in which objects appear in the video and list the object names in chronological order. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_abs_distance":"Calculate the absolute distance between two objects in the video. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_counting":"Count the total number of times a certain type of object appears in the video and output this value. For this type of problem, there is no limit to the number of objects involved in the problem. Questions are raised regarding the types of objects in this type of object.",
    "object_rel_distance":"Determine which of the candidate objects is the closest to the target object. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_size_estimation":"Determine the length, width and height of the objects in the video and output the corresponding dimensions. Each time you ask a question, only one dimension of length, width, height and height needs to be inquired. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_direction_facing_complex":"Given three objects, after determining the perspective through two of them, determine the relative position of the other object in the video.Relative position includes front-left, front-right, back-left, or back-right. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem. Additionally, it is necessary to indicate in the problem from which object the viewing Angle points to which object.",
    "object_volume_comparison":"Compare the volume sizes of multiple objects in the video to find the largest or smallest one. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_in_frame":"Identify all the objects that appear in the video at a certain moment and output them by category. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_volume_estimation":"Identify the volume of the object and output the corresponding value. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem. Therefore, the problems raised are all volume estimates for a single object.",
    "object_height_determination":"Identify the height differences of objects and determine which one is the highest. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "temporal_appearance_sequence":"Analyze the sequence of objects based on the chronological order of their appearance, such as whether the window appears before or after the sofa. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem",
    "object_nearby":"For problems like identifying which objects are within 5 meters in front of a certain object, only the object with a quantity of 1 can be selected among the objects involved in the problem.",
    "object_direction_facing_simple":"Given three objects, after determining the perspective through two of them, determine the relative position of the other object in the video.Relative position includes left, right. For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem. Additionally, it is necessary to indicate in the problem from which object the viewing Angle points to which object.",
    "object_below":"Determine whether one object is positioned at a lower elevation relative to the other.For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem",
    "object_above":"Assess the relative vertical positions of two objects to establish whether one is positioned above the other.For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem.",
    "High_and_low_position":"Given two objects, assess their relative vertical positions to identify which one is at a higher elevation.For such problems, only objects with a quantity of 1 can be selected among the objects involved in the problem"
}
